config/language-modes/sql.el
;; -*- lexical-binding: t; -*-

(defvar jf/sql-connections nil
  "Alist of SQL database connection definitions.
Each entry has the form (NAME . PLIST) where PLIST contains:
  :sql-product - Database product (postgres, mysql, sqlite, oracle, sqlserver) (required)
  :host        - Hostname or 'docker for containers (required for most products)
  :port        - Port number (product-specific defaults)
  :database    - Database name (required)
  :user        - Username (required for most products)
  :docker-name - Docker container name (required if :host is 'docker)
  :auth-key    - Host key for auth-source lookup (overrides default lookup)

Example:
  (setq jf/sql-connections
        '((pg-local-dev
           :sql-product postgres
           :host \"localhost\"
           :port 5432
           :database \"dev_db\"
           :user \"postgres\"
           :auth-key \"pg-local-dev\")
          (mysql-prod
           :sql-product mysql
           :host \"prod.example.com\"
           :port 3306
           :database \"app_db\"
           :user \"appuser\"
           :auth-key \"mysql-prod\")
          (sqlite-local
           :sql-product sqlite
           :database \"/path/to/database.db\")
          (docker-postgres
           :sql-product postgres
           :host docker
           :docker-name \"my-postgres-container\"
           :database \"testdb\"
           :user \"postgres\"
           :auth-key \"docker-postgres\")))")

(defun jf/sql-get-auth-details (auth-key sql-product)
  "Retrieve all authentication details for AUTH-KEY from auth-source.
Returns a plist with :user :password :host :port :database, or nil if not found.

SQL-PRODUCT is used to determine default port if not specified in auth-source.
AUTH-KEY can be a symbol or string.

Auth-source looks up AUTH-KEY in ~/.authinfo.gpg using the 'machine' field.
Custom netrc properties (server, database) are preserved in the returned plist."
  ;; Convert auth-key to string (auth-source-search requires string for :host)
  (let ((host-key (if (stringp auth-key) auth-key (symbol-name auth-key))))
    (when-let* ((auth-info (car (auth-source-search :host host-key :require '(:secret))))
                (secret (plist-get auth-info :secret))
                (password (if (functionp secret) (funcall secret) secret)))
      (let* ((port-value (plist-get auth-info :port))
             (default-port (pcase sql-product
                             ('postgres 5432)
                             ('mysql 3306)
                             ('oracle 1521)
                             ('sqlserver 1433)
                             (_ nil))))
        (list :user (plist-get auth-info :user)
              :password password
              :host (or (plist-get auth-info :server) "127.0.0.1")
              :port (if port-value
                        (if (stringp port-value)
                            (string-to-number port-value)
                          port-value)
                      default-port)
              :database (plist-get auth-info :database))))))

(defun jf/sql-get-docker-port (container-name internal-port)
  "Get the host port mapped to INTERNAL-PORT in CONTAINER-NAME.
Returns port number or INTERNAL-PORT if container is not found or port not mapped."
  (let* ((cmd (format "docker port %s %d 2>/dev/null | cut -d: -f2"
                     (shell-quote-argument container-name)
                     internal-port))
         (output (string-trim (shell-command-to-string cmd))))
    (if (string-empty-p output)
        (progn
          (warn "Could not determine port for Docker container: %s (port %d). Using default %d."
                container-name internal-port internal-port)
          internal-port)
      (string-to-number output))))

(defun jf/sql-get-connection-params (connection-name)
  "Get connection parameters for CONNECTION-NAME.
Returns a plist with :sql-product :host :port :database :user :password.
Resolves Docker containers to localhost with appropriate port.
Fetches all details from auth-source.

For SQLite databases, :database contains the file path and :host/:port/:user are nil."
  (let* ((conn-name (if (stringp connection-name)
                        (intern connection-name)
                      connection-name))
         (conn-plist (cdr (assoc conn-name jf/sql-connections)))
         (sql-product (plist-get conn-plist :sql-product))
         (auth-key (or (plist-get conn-plist :auth-key) conn-name))
         (docker-name (plist-get conn-plist :docker-name)))

    (unless sql-product
      (error "Connection %s missing :sql-product. Must be one of: postgres, mysql, sqlite, oracle, sqlserver" conn-name))

    ;; SQLite special case: file-based, no server/auth
    (if (eq sql-product 'sqlite)
        (let ((database (plist-get conn-plist :database)))
          (unless database
            (error "SQLite connection %s missing :database (file path)" conn-name))
          (list :sql-product sql-product
                :database database
                :host nil
                :port nil
                :user nil
                :password nil))

      ;; Server-based databases: retrieve from auth-source
      (let ((auth-details (jf/sql-get-auth-details auth-key sql-product)))
        (unless auth-details
          (error "No auth-source entry found for: %s. Check ~/.authinfo.gpg" auth-key))

        (let ((host (plist-get auth-details :host))
              (port (plist-get auth-details :port))
              (database (plist-get auth-details :database))
              (user (plist-get auth-details :user))
              (password (plist-get auth-details :password)))

          ;; Handle Docker containers (override host/port from auth-source)
          ;; Use 127.0.0.1 instead of localhost to force TCP connection (not Unix socket)
          (when docker-name
            (setq host "127.0.0.1")
            (setq port (jf/sql-get-docker-port docker-name port)))

          ;; Validate required fields
          (unless (and host database user)
            (error "Incomplete connection details for %s. Required: server, database, login in .authinfo.gpg" auth-key))

          (list :sql-product sql-product
                :host host
                :port port
                :database database
                :user user
                :password password))))))
