config/language-modes/sql.org
* SQL Connection Builder
Build sql-connection-alist entries for use with org-babel's :dbconnection parameter.

#+begin_src emacs-lisp
(defun jf/sql-build-connection (connection-name)
  "Build sql-connection-alist entry for CONNECTION-NAME.
Returns a connection specification suitable for sql-connection-alist.
Handles all supported database products (postgres, mysql, sqlite, oracle, sqlserver)."
  (let* ((params (jf/sql-get-connection-params connection-name))
         (sql-product (plist-get params :sql-product)))
    (if (eq sql-product 'sqlite)
        ;; SQLite: only database (file path)
        `(,connection-name
          (sql-product ',sql-product)
          (sql-database ,(plist-get params :database)))
      ;; Server-based databases
      `(,connection-name
        (sql-product ',sql-product)
        (sql-server ,(plist-get params :host))
        (sql-port ,(plist-get params :port))
        (sql-database ,(plist-get params :database))
        (sql-user ,(plist-get params :user))
        (sql-password ,(plist-get params :password))))))
#+end_src

* Connection Registration
Register all defined SQL connections into Emacs' sql-connection-alist.

#+begin_src emacs-lisp
(defun jf/sql-register-connections ()
  "Register all jf/sql-connections into sql-connection-alist.
This makes them available to org-babel via :dbconnection parameter."
  (interactive)
  (when jf/sql-connections
    (dolist (conn jf/sql-connections)
      (let* ((name (car conn))
             (entry (jf/sql-build-connection name)))
        ;; Remove existing entry if present
        (setq sql-connection-alist
              (assq-delete-all name sql-connection-alist))
        ;; Add new entry
        (push entry sql-connection-alist)))
    (message "Registered %d SQL connection%s"
             (length jf/sql-connections)
             (if (= 1 (length jf/sql-connections)) "" "s"))))

;; Auto-register connections after loading sql.el
(with-eval-after-load 'sql
  (jf/sql-register-connections))
#+end_src

* Helper Functions
Utility functions for managing and testing SQL connections.

** List Connections
#+begin_src emacs-lisp
(defun jf/sql-list-connections ()
  "Display all registered SQL connections."
  (interactive)
  (if (not jf/sql-connections)
      (message "No SQL connections defined. Set jf/sql-connections in your config.")
    (with-output-to-temp-buffer "*SQL Connections*"
      (princ "Registered SQL Connections:\n\n")
      (dolist (conn jf/sql-connections)
        (let* ((name (car conn))
               (plist (cdr conn))
               (sql-product (plist-get plist :sql-product))
               (host (plist-get plist :host))
               (port (plist-get plist :port))
               (database (plist-get plist :database))
               (user (plist-get plist :user)))
          (princ (format "  %s (%s)\n" name sql-product))
          (if (eq sql-product 'sqlite)
              (princ (format "    Database: %s\n\n" database))
            (princ (format "    Host: %s:%s\n" host (or port "default")))
            (princ (format "    Database: %s\n" database))
            (princ (format "    User: %s\n\n" user))))))))
#+end_src

** Test Connection
#+begin_src emacs-lisp
(defun jf/sql-test-connection (connection-name)
  "Test SQL connection CONNECTION-NAME.
Executes a simple query to verify connectivity."
  (interactive
   (list (completing-read "Test connection: "
                         (mapcar #'car jf/sql-connections)
                         nil t)))
  (let* ((params (jf/sql-get-connection-params connection-name))
         (sql-product (plist-get params :sql-product)))
    (message "Testing connection %s (%s)..." connection-name sql-product)
    (pcase sql-product
      ('postgres (jf/sql--test-postgres params connection-name))
      ('mysql (jf/sql--test-mysql params connection-name))
      ('sqlite (jf/sql--test-sqlite params connection-name))
      (_ (message "✗ Test not implemented for %s" sql-product)))))

(defun jf/sql--test-postgres (params connection-name)
  "Test PostgreSQL connection with PARAMS and CONNECTION-NAME."
  (let* ((host (plist-get params :host))
         (port (plist-get params :port))
         (database (plist-get params :database))
         (user (plist-get params :user))
         (password (plist-get params :password))
         (pgpassword-env (if password (format "PGPASSWORD=%s" password) ""))
         (cmd (format "%s psql -h %s -p %d -U %s -d %s -c 'SELECT version();' 2>&1"
                     pgpassword-env host port user database))
         (output (shell-command-to-string cmd)))
    (if (string-match-p "PostgreSQL" output)
        (message "✓ Connection successful: %s" connection-name)
      (message "✗ Connection failed: %s\n%s" connection-name output))))

(defun jf/sql--test-mysql (params connection-name)
  "Test MySQL connection with PARAMS and CONNECTION-NAME."
  (let* ((host (plist-get params :host))
         (port (plist-get params :port))
         (database (plist-get params :database))
         (user (plist-get params :user))
         (password (plist-get params :password))
         (cmd (format "mysql -h %s -P %d -u %s -p%s -D %s -e 'SELECT version();' 2>&1"
                     host port user password database))
         (output (shell-command-to-string cmd)))
    (if (string-match-p "^[0-9]+\\.[0-9]+" output)
        (message "✓ Connection successful: %s" connection-name)
      (message "✗ Connection failed: %s\n%s" connection-name output))))

(defun jf/sql--test-sqlite (params connection-name)
  "Test SQLite connection with PARAMS and CONNECTION-NAME."
  (let* ((database (plist-get params :database))
         (cmd (format "sqlite3 %s 'SELECT sqlite_version();' 2>&1"
                     (shell-quote-argument database)))
         (output (shell-command-to-string cmd)))
    (if (string-match-p "^[0-9]+\\.[0-9]+" output)
        (message "✓ Connection successful: %s (SQLite %s)" connection-name (string-trim output))
      (message "✗ Connection failed: %s\n%s" connection-name output))))
#+end_src

** Insert Source Block
#+begin_src emacs-lisp
(defun jf/sql-insert-src-block (connection-name)
  "Insert an org-babel SQL source block with CONNECTION-NAME."
  (interactive
   (list (completing-read "Database connection: "
                         (mapcar #'car jf/sql-connections)
                         nil t)))
  (let* ((conn-plist (cdr (assoc (intern connection-name) jf/sql-connections)))
         (sql-product (plist-get conn-plist :sql-product))
         (engine (pcase sql-product
                   ('postgres "postgresql")
                   ('mysql "mysql")
                   ('sqlite "sqlite")
                   ('oracle "oracle")
                   ('sqlserver "ms")
                   (_ "sql"))))
    (insert (format "#+begin_src sql :engine %s :dbconnection %s\n"
                    engine connection-name))
    (insert "SELECT current_database(), current_user, version();\n")
    (insert "#+end_src\n")
    (forward-line -2)
    (end-of-line)))
#+end_src

