config/language-modes/sql.org
** Connect to Database
#+begin_src emacs-lisp
(defun jf/sql-connect (connection-name)
  "Connect to SQL database using CONNECTION-NAME from jf/sql-connections.
Resolves connection parameters (Docker ports, auth-source passwords) and opens SQL buffer."
  (interactive
   (list (intern (completing-read "Database connection: "
                                   (mapcar #'car jf/sql-connections)
                                   nil t))))
  (unless jf/sql-connections
    (error "No SQL connections defined. Set jf/sql-connections in your config."))

  ;; Ensure sql.el is loaded (defines sql-connection-alist)
  (require 'sql)

  ;; Get connection parameters
  (let* ((params (jf/sql-get-connection-params connection-name))
         (sql-product (plist-get params :sql-product))
         (password (plist-get params :password))
         (entry (jf/sql-build-connection connection-name)))

    ;; Remove old entry if present and add fresh one
    (setq sql-connection-alist
          (assq-delete-all connection-name sql-connection-alist))
    (push entry sql-connection-alist)

    ;; Set product-specific environment variables for password
    (when password
      (pcase sql-product
        ('postgres (setenv "PGPASSWORD" password))
        ('mysql (setenv "MYSQL_PWD" password))))

    ;; Connect using built-in sql-connect
    (unwind-protect
        (sql-connect connection-name)
      ;; Clear password environment variables after connection for security
      (setenv "PGPASSWORD" nil)
      (setenv "MYSQL_PWD" nil))))
#+end_src

** Refresh Connections
#+begin_src emacs-lisp
(defun jf/sql-refresh-connections ()
  "Reload machine-specific config and re-register SQL connections."
  (interactive)
  (if (null jf/machine-role)
      (error "Machine role not set. Please create ~/.machine-role with one of: apploi-mac, personal-mac, personal-mac-air")
    (let ((config-file (expand-file-name
                        (format "config/local/%s.el" jf/machine-role)
                        jf/emacs-dir)))
      (if (file-exists-p config-file)
          (progn
            (load-file config-file)
            (jf/sql-register-connections)
            (message "Refreshed SQL connections from %s" config-file))
        (error "Machine-specific config not found: %s" config-file)))))
#+end_src

* CSV File Viewing
Configure csv-mode for viewing large query result files.

[[https://elpa.gnu.org/packages/csv-mode.html][Documentation]]

#+begin_src emacs-lisp
(use-package csv-mode
  :straight t
  :mode "\\.csv\\'"
  :config
  (setq csv-separators '("," ";" "|" "\t")))
#+end_src

* Error Handling
Verify that required tools are installed.

#+begin_src emacs-lisp
(defun jf/sql-check-cli-tools ()
  "Verify that SQL CLI tools are installed for configured connections.
Reports availability of psql, mysql, sqlite3, sqlplus, sqlcmd."
  (interactive)
  (let ((tools '(("psql" . "PostgreSQL")
                 ("mysql" . "MySQL/MariaDB")
                 ("sqlite3" . "SQLite")
                 ("sqlplus" . "Oracle")
                 ("sqlcmd" . "SQL Server")))
        (results '()))
    (dolist (tool tools)
      (let ((cmd (car tool))
            (product (cdr tool)))
        (if (executable-find cmd)
            (push (format "✓ %s (%s)" product cmd) results)
          (push (format "✗ %s (%s) not found" product cmd) results))))
    (if (called-interactively-p 'any)
        (message "%s" (mapconcat #'identity (nreverse results) "\n"))
      (nreverse results))))

;; Run check on load (only reports errors)
(with-eval-after-load 'sql
  (let ((results (jf/sql-check-cli-tools)))
    (dolist (result results)
      (when (string-prefix-p "✗" result)
        (message "%s" result)))))
#+end_src

* Usage Examples
** Basic Query
Execute a simple query against a named connection:

#+begin_example
#+begin_src sql :engine postgresql :dbconnection pg-local-dev
SELECT current_database(), current_user, version();
#+end_src
#+end_example

** Query with Results Table
Return query results as an org-mode table:

#+begin_example
#+begin_src sql :engine postgresql :dbconnection prod-db :results table
SELECT id, email, created_at
FROM users
WHERE created_at > NOW() - INTERVAL '7 days'
LIMIT 10;
#+end_src
#+end_example

** Docker Container Query
Query a database running in a Docker container:

#+begin_example
#+begin_src sql :engine postgresql :dbconnection docker-postgres
SELECT tablename FROM pg_tables WHERE schemaname = 'public';
#+end_src
#+end_example

** SQLite Query
Query a local SQLite database file:

#+begin_example
#+begin_src sql :engine sqlite :dbconnection sqlite-local
SELECT name, type FROM sqlite_master WHERE type='table';
#+end_src
#+end_example

* Configuration Notes
** Auth-Source Format
Store all connection details in =~/.authinfo.gpg= with custom netrc properties:

#+begin_example
machine pg-local-dev login postgres password yourpassword port 5432 database myapp_dev
machine mysql-prod login appuser password secretpass port 3306 server prod.example.com database myapp_prod
machine docker-postgres login postgres password dockerpass port 5432 database testdb
#+end_example

**Field descriptions**:
- =machine= - Logical connection name (matches key in jf/sql-connections)
- =login= - Database username
- =password= - Database password
- =port= - Port number (product-specific defaults: PostgreSQL 5432, MySQL 3306, Oracle 1521, SQL Server 1433)
- =server= - Actual hostname (for remote connections; use this for RDS endpoints)
- =database= - Database name

**Notes**:
- For localhost/Docker connections: omit =server= field (defaults to 127.0.0.1)
- For remote connections: use =server= field for the actual hostname
- Auth-source automatically reads custom fields like =server= and =database=
- SQLite connections don't need auth-source entries (file-based, no authentication)

** Machine-Specific Connections
Define minimal connection metadata in your machine-specific config (e.g., =config/local/Mac.home.el=):

All sensitive details (host, port, database, user, password) are stored in =~/.authinfo.gpg=. Only connection names, sql-product, and Docker-specific metadata need to be in your config files.

#+begin_src emacs-lisp :tangle no
;; SQL connections - sensitive details stored in ~/.authinfo.gpg
(setq jf/sql-connections
      '((pg-local-dev
         :sql-product postgres)        ; Minimal metadata, auth-source has details
        (mysql-prod
         :sql-product mysql)
        (sqlite-local
         :sql-product sqlite
         :database "/path/to/database.db")  ; SQLite: file path required
        (docker-postgres
         :sql-product postgres
         :docker-name "postgres-dev")))     ; Docker needs container name
#+end_src

**Required properties**:
- =:sql-product= - Database product (postgres, mysql, sqlite, oracle, sqlserver) - REQUIRED

**Optional properties**:
- =:docker-name= - Docker container name (required for Docker connections)
- =:auth-key= - Override the auth-source lookup key (defaults to connection name)
- =:database= - File path (required for SQLite, otherwise from auth-source)

** Interactive Commands
- =M-x jf/sql-connect= - Connect to a database using saved connection
- =M-x jf/sql-list-connections= - Display all configured connections
- =M-x jf/sql-test-connection= - Test a connection
- =M-x jf/sql-insert-src-block= - Insert a SQL source block template
- =M-x jf/sql-check-cli-tools= - Check availability of SQL CLI tools

* TODO Future Improvements
- Add query result caching with TTL
- Implement transaction support (BEGIN/COMMIT/ROLLBACK)
- DONE Add schema introspection for auto-complete (implemented in postgres-completion.org)
- Support AWS RDS IAM authentication
- Add connection pooling for performance
- Support for connection profiles (dev/staging/prod)
- Expand test coverage to Oracle and SQL Server
