config/language-modes/sql.el

(defun jf/sql-connect (connection-name)
  "Connect to SQL database using CONNECTION-NAME from jf/sql-connections.
Resolves connection parameters (Docker ports, auth-source passwords) and opens SQL buffer."
  (interactive
   (list (intern (completing-read "Database connection: "
                                   (mapcar #'car jf/sql-connections)
                                   nil t))))
  (unless jf/sql-connections
    (error "No SQL connections defined. Set jf/sql-connections in your config."))

  ;; Ensure sql.el is loaded (defines sql-connection-alist)
  (require 'sql)

  ;; Get connection parameters
  (let* ((params (jf/sql-get-connection-params connection-name))
         (sql-product (plist-get params :sql-product))
         (password (plist-get params :password))
         (entry (jf/sql-build-connection connection-name)))

    ;; Remove old entry if present and add fresh one
    (setq sql-connection-alist
          (assq-delete-all connection-name sql-connection-alist))
    (push entry sql-connection-alist)

    ;; Set product-specific environment variables for password
    (when password
      (pcase sql-product
        ('postgres (setenv "PGPASSWORD" password))
        ('mysql (setenv "MYSQL_PWD" password))))

    ;; Connect using built-in sql-connect
    (unwind-protect
        (sql-connect connection-name)
      ;; Clear password environment variables after connection for security
      (setenv "PGPASSWORD" nil)
      (setenv "MYSQL_PWD" nil))))

(defun jf/sql-refresh-connections ()
  "Reload machine-specific config and re-register SQL connections."
  (interactive)
  (if (null jf/machine-role)
      (error "Machine role not set. Please create ~/.machine-role with one of: apploi-mac, personal-mac, personal-mac-air")
    (let ((config-file (expand-file-name
                        (format "config/local/%s.el" jf/machine-role)
                        jf/emacs-dir)))
      (if (file-exists-p config-file)
          (progn
            (load-file config-file)
            (jf/sql-register-connections)
            (message "Refreshed SQL connections from %s" config-file))
        (error "Machine-specific config not found: %s" config-file)))))

(use-package csv-mode
  :straight t
  :mode "\\.csv\\'"
  :config
  (setq csv-separators '("," ";" "|" "\t")))

(defun jf/sql-check-cli-tools ()
  "Verify that SQL CLI tools are installed for configured connections.
Reports availability of psql, mysql, sqlite3, sqlplus, sqlcmd."
  (interactive)
  (let ((tools '(("psql" . "PostgreSQL")
                 ("mysql" . "MySQL/MariaDB")
                 ("sqlite3" . "SQLite")
                 ("sqlplus" . "Oracle")
                 ("sqlcmd" . "SQL Server")))
        (results '()))
    (dolist (tool tools)
      (let ((cmd (car tool))
            (product (cdr tool)))
        (if (executable-find cmd)
            (push (format "✓ %s (%s)" product cmd) results)
          (push (format "✗ %s (%s) not found" product cmd) results))))
    (if (called-interactively-p 'any)
        (message "%s" (mapconcat #'identity (nreverse results) "\n"))
      (nreverse results))))

;; Run check on load (only reports errors)
(with-eval-after-load 'sql
  (let ((results (jf/sql-check-cli-tools)))
    (dolist (result results)
      (when (string-prefix-p "✗" result)
        (message "%s" result)))))
